[{"title":"Before You Travel","questions":[{"text":"How do I know if I have successfully completed my booking / order?","markdown":"Once your booking is confirmed, you will receive an automated e-mail containing your confirmation number and full details of the product that you have purchased. If you have not received an e-mail confirmation, please see the answer below. Alternatively, you can [click here](https://travel.london-luton.co.uk/helpme/) to access your booking."},{"text":"I haven't received or I have lost my confirmation e-mail, how do I get another copy?","markdown":"If you have not received your confirmation e-mail within 4 hours of making a booking or have lost the e-mail, please check your ‘deleted items' and 'Junk Mail' folders. Alternatively, to check if the booking was successfully made and obtain another copy of your confirmation e-mail you can [click here](https://travel.london-luton.co.uk/helpme/) to access your booking."},{"text":"What are electronic tickets (or E-ticket)?","markdown":"Electronic tickets are stored within the airlines reservation system rather than printed on a paper copy. The service is similar to the traditional paper ticket process, but eliminates the time and hassle associated with purchasing or exchanging a paper ticket. Your confirmation email will act as your e-ticket."},{"text":"What if I need an invoice or receipt?","markdown":"You can use your confirmation e-mail as a receipt or invoice for your booking. If you require a new copy of your confirmation e-mail, you can [click here](https://travel.london-luton.co.uk/helpme/) to resend."},{"text":"Which airline am I flying with?","markdown":"The confirmation e-mail sent at the time of your booking contains the airline information relating to your flight."},{"text":"What time should I check in for my flight?","markdown":"Please note that it is always best to check with the airline for accurate check in times. We recommend that you check in at least 2 hours prior to departure for a short hall flight and at least 3 hours for a long-haul flight."},{"text":"What happens if my booking is changed or cancelled by the supplier?","markdown":"In the unlikely event the airline has to cancel your booking you will be notified as soon as possible, and we will endeavour to find a suitable alternative on your behalf, if this is not possible a refund will be made. Minor changes will be advised to you as soon as possible by email."},{"text":"There is a mistake on my confirmation / e-mail / documentation, what should I do?","markdown":"If you see a mistake on your confirmation e-mail or documentation, please fill in and submit the [Contact us form](https://travel.london-luton.co.uk/contact/) and one of our agents will be happy to assist you with your enquiry. Please note once documentation has been issued, changes will be subject to the carrier’s rules and penalty procedures."},{"text":"Can I change the details or travel dates of my booking?","markdown":"This will depend on what changes you need to make and what the rules are for the specific flight you have booked.  \nIf you wish to amend a booking or wish to enquiry if a specific change can be made, then please fill in the [Contact us form](https://travel.london-luton.co.uk/contact/) and submit your change or enquiry. We will then be able to check the booking details and get back to you as soon as possible to advise if the amendment is possible and if it will incur a refund or additional charge. In some cases, flights are totally non-refundable and non-changeable and so the airline would treat changes to travel dates as a cancellation and you would need to re-book and pay again. For more flexible tickets and hotels reservations, our typical amendment fees are"},{"text":"How do I cancel my booking?","markdown":"All cancellations must be received by email. To submit a cancellation request please use our [Contact us form](https://travel.london-luton.co.uk/contact/) and supply the booking / order reference number, we aim to respond to your enquiry within 24 hours.  \nHotels - Some hoteliers will impose a charge to cancel your booking in accordance to their booking policies and this will also depend on the type of room and tariff you have booked. Some rooms are classed as non-refundable from the time they are booked. If you are eligible for a part refund, we will impose an administration fee to process this on top of any hotelier charges.  \nFlights - Most airline tickets are completely non-refundable. For this reason, we recommend that you take out adequate travel insurance before booking. However, cancellation charges can vary depending on your airline and in some cases, a part refund can be obtained, which is calculated by deducting the airline's cancellation fee and our administration fee. Full fees will be explained to you at the time of cancellation."},{"text":"How long does it take to process a refund for my flight?","markdown":"Most tickets are non-changeable/non-refundable, however any refunds that may be applicable will be issued within 8-12 weeks.  \nIf you would like to cancel your booking or have an enquiry, please e-mail us by filling in and submitting the [Contact us form](https://travel.london-luton.co.uk/contact/)."}]},{"title":"At the Airport","questions":[{"text":"How do I get to and from the Airport?","markdown":"Plan your journey to the airport whether it's by car, transfer or public transport, with our 'To & from the airport' guide by [clicking here](https://www.london-luton.co.uk/to-and-from-lla)"},{"text":"What do I need to know about travelling through London Luton Airport?","markdown":"To make your experience of travelling through London Luton Airport as easy as possible, please view our easy [passenger guide.](https://www.london-luton.co.uk/inside-lla)"},{"text":"Where can I park at London Luton Airport?","markdown":"There are great value parking options at London Luton Airport. Whether you are looking for Long Term, Short Term or Priority Parking, [click here](https://www.london-luton.co.uk/parking)"}]},{"title":"Flights","questions":[{"text":"Online check in?","markdown":"Online check-in is quick and free to do.  \nHowever please be aware that some low cost airlines such as [Easyjet](https://www.easyjet.com/), [Jet2](https://www.jet2.com/) and [Ryanair](https://www.ryanair.com/) no longer offer a check-in service at the airport, therefore all passengers must check-in online before departure. You can now check-in online up to 28 days before you travel.  \nMost scheduled airlines will allow you to check in online 24hrs before departure. The unique airline reference is shown above the ticket number on your email. You will need to print out your boarding pass and register your baggage with the airline. Once you arrive at the airport you can drop off your luggage at the airline’s baggage counter and go straight to the departure gate.  \nFor flights that do not have an online check in facility, when you arrive at the airline check in desk you will be required to present the following items in order to receive your boarding pass:  \n  \n  \n\\- Appropriate identification and travel documents i.e. passport, visa if required, etc.  \n  \n  \n\\- A printout of your confirmation page or confirmation e-mail to present to the check in representative.  \n  \n  \n\\- The credit/debit card you paid with (This only applies if you are flying with SASK or Air France).  \n  \n  \nPlease note: It is the passengers' responsibility to check and obtain the relevant passport, visa and health inoculations for the country they are travelling to."},{"text":"What is my baggage allowance?","markdown":"The baggage allowance to which you are entitled will vary from airline to airline and between scheduled carriers like KLM, Air France, BA and low-cost carriers like EasyJet and Ryanair.  \nMost low cost carriers will almost always charge for checked luggage. This should have been offered to you as an option during the booking process and will be shown on your flight confirmation. Hand luggage to be taken into the aircraft cabin is strictly limited and must conform to both the weight and the size allowance that the airline specifies.  \nSports equipment - Although some airlines do not need notification of any sports equipment you might be taking up to your allocated allowance. PLEASE CHECK with your airline as baggage weighing over this amount may incur an extra charge at check in.  \nAmounts may vary according to destination and airline so please refer to our airline information page for more information."},{"text":"Can I use the return portion of my flight ticket, without using the outward?","markdown":"You are required to use all flight coupons in order of sequence. If you do not travel on the outbound flight, then the airline may cancel the ticket and any subsequent flights booked."},{"text":"Pregnant Flyers?","markdown":"If you are travelling while pregnant you should seek the advice of your GP before booking. Most airlines follow the below guidelines.  \nUp to 28 weeks: Normally ok to travel for single pregnancies.  \nBetween 28 - 36 weeks: Airlines may require a Pregnancy Information Form from your doctor.  \nAfter 36 weeks: Not permitted to travel."},{"text":"At what age can a baby travel on an aircraft?","markdown":"An infant must be more than 7 days old to travel on an aircraft, for health and safety reasons."},{"text":"At what age is an air passenger considered an infant/child?","markdown":"Infant: 0 - 23 months for the full travel period.  \nChild: 2 - 11 years for the full travel period. Infants are not allocated a seat and will be required to travel on an adult's lap. If you require a seat for your infant, you will need to purchase a child seat."},{"text":"At what age does my child cease to qualify as an infant on an aircraft?","markdown":"Infants must be under 2 years old on the return date of travel. If your child celebrates his or her 2nd birthday while on holiday, you must book and pay the appropriate child fare. Charges for infants vary depending on the route and length of flight and will be advised in the booking process. Infants are not entitled to their own seat and must travel on an adult’s lap. If you require a seat for your infant to sit separately you will need to purchase a child’s ticket at the appropriate fare. Infants do not always receive a personal baggage allowance as this varies from carrier to carrier."},{"text":"At what age does my child have to pay the full adult fare on an aircraft?","markdown":"Children must be 2 - 11 years old on the return date of travel to qualify for any applicable child fare reduction. Children aged 12 years and older pay the full fare and have their own seat and also have a full baggage allowance."},{"text":"At what age can passengers travel alone?","markdown":"When travelling on an arrangement including hotel accommodation, no person under the age of 18* years will be allowed to travel independently. *The exception is for Las Vegas where visitors are required to be 21 years old if unaccompanied. The passenger’s age relates to the whole of the period when they are away including the day of return.  \nWhen travelling on a flight-only basis, passengers can only travel alone if they are aged 14 years or over subject to airline approval, providing they can travel unassisted. Please note if they are aged 14 - 15, a parent or legal guardian must accompany them to check-in, and a valid photo-id in addition to the country specific documentation must be presented. We strongly recommend that parents or guardians of unaccompanied young persons remain in the airport until the flight has departed. Airlines reserve the right not to accept unaccompanied minors under 14 years of age for carriage."},{"text":"I have a traveller with a disability or special need in my party, how can I make suitable arrangements?","markdown":"Before booking for a passenger with any sort of disability or special need, we would strongly recommend that you contact us by email, and we will call you to discuss the passenger's actual requirements.  \nWheelchair assistance - Airlines have their own individual guidelines regarding the provision and carriage of wheelchairs and they will need to know the weight, dimensions and type if you are taking your own wheelchair and other relevant information for the safety and comfort of the passenger during the flight. Please contact your airline directly with this information a minimum of 48hrs before travel.  \nHotels vary in their suitability for disabled passengers and we would strongly recommend you conduct your own research into whether the hotel will cater for your requirements. We will also need to inform our hotel providers for their advice and instructions relating to such bookings.  \nWebsites such as TripAdvisor can be very useful when investigating hotel facilities and can often provide a reasonable guide to the services available. This is in addition to a hotel's own website, the accuracy of which always remains the hotel's own responsibility, and for which we cannot guarantee accuracy or take any responsibility."},{"text":"Special requests?","markdown":"Please note any requests made to airlines, hotels, transfer providers and car hire suppliers cannot be guaranteed, and we cannot accept responsibility for any of our suppliers if they fail to provide the requested service. For further information please refer to our [Terms & Conditions](https://travel.london-luton.co.uk/terms-conditions)."}]},{"title":"Hotels","questions":[{"text":"Why do some hotels require a credit card imprint on check-in?","markdown":"This is a standard requirement in most hotels worldwide and is only taken as a precaution, so as to guarantee payment of any incidental charges (such as telephone calls, room service etc.). On check-out, the hotel will usually give the option of paying by cash instead."}]},{"title":"Travel Extras","questions":[{"text":"Are transfers included in 'Holidays'?","markdown":"Transfers are only included in your booking if stated in the 'price includes' section on the website."}]},{"title":"Travel Aware","questions":[{"text":"How do I check it is safe to travel to my holiday destination?","markdown":"We recommend that you check the Foreign and Commonwealth Office Travel Advice webpage for the latest updates and information relating to your holiday destination. [www.gov.uk/travelaware](https://www.gov.uk/travelaware)"},{"text":"What are my passport & Visa Requirements?","markdown":"For all international flights, you should ensure your passport has at least 6 months validity left after your length of stay as this is a requirement for many countries. You will be expected to provide your passport details at check in using either online or at the airport check in desk. For more information concerning passport requirements please visit FCO passport page. It is your responsibility to find out if you and your party will need to obtain the necessary visas for travel, please be aware some applications can take some time to process so make sure you apply in plenty of time as passengers without the correct documentation may be refused entry."},{"text":"Will travel to the EU change after Brexit?","markdown":"For the latest guidance on travel EU after Brexit please review see the links below  \n[www.passport.service.gov.uk/check-a-passport](https://www.passport.service.gov.uk/check-a-passport)  \n[www.gov.uk/guidance/passport-rules-for-travel-to-europe-after-brexit](https://www.gov.uk/guidance/passport-rules-for-travel-to-europe-after-brexit)"},{"text":"How can I make a complaint?","markdown":"If you have experienced a problem with your booking, please do contact us with the full details of the issue including your booking reference and travel dates and we will investigate this for you. You can contact us by [clicking here](https://travel.london-luton.co.uk/contact/) here.  \nPlease allow up to 28 days for a response from us to your query."}]}]